In [1]:
import pandas as pd

In [2]:
x=pd.DataFrame({"RollNo":[1,2,3],"Name":["Tejas","Gauri","Yash"]})

In [3]:
x

   RollNo   Name
0       1  Tejas
1       2  Gauri
2       3   Yash

In [4]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  3 non-null      int64
 1   Name    3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [5]:
x.describe()

       RollNo
count     3.0
mean      2.0
std       1.0
min       1.0
25%       1.5
50%       2.0
75%       2.5
max       3.0

In [6]:
x.isnull()

   RollNo   Name
0   False  False
1   False  False
2   False  False

In [7]:
x.duplicated()

0    False
1    False
2    False
dtype: bool

In [8]:
x.head(2)

   RollNo   Name
0       1  Tejas
1       2  Gauri

In [9]:
x.tail(1)

   RollNo  Name
2       3  Yash

In [10]:
x.tail(2)

   RollNo   Name
1       2  Gauri
2       3   Yash

In [11]:
type(x)

pandas.core.frame.DataFrame

In [12]:
type(x.RollNo)

pandas.core.series.Series